test/fixtures/files/stripe/checkout_session_completed.json

{
  "id":"evt_1HfmqLI4g05dLynGD2sQHt2t",
  "object":"event",
  "api_version":"2020-08-27",
  "created":1603546297,
  "data":{
    "object":{
      "id":"cs_test_IIkDUzSTYjY3svvrw0GWddlC4Nls6cQGhBlbdp3bHzBmw7YFImccq3G8",
      "object":"checkout.session",
      "allow_promotion_codes":null,
      "amount_subtotal":3000,
      "amount_total":3000,
      "billing_address_collection":null,
      "cancel_url":"https://httpbin.org/post",
      "client_reference_id":null,
      "currency":"usd",
      "customer":"cus_IGJTlPYKxCu0ZM",
      "customer_email":null,
      "livemode":false,
      "locale":null,
      "metadata":{

      },
      "mode":"payment",
      "payment_intent":"pi_1HfmqII4g05dLynGZF9YH5za",
      "payment_method_types":[
        "card"
      ],
      "payment_status":"paid",
      "setup_intent":null,
      "shipping":null,
      "shipping_address_collection":null,
      "submit_type":null,
      "subscription":"NEW CHECKOUT SUBSCRIPTION",
      "success_url":"https://httpbin.org/post",
      "total_details":{
        "amount_discount":0,
        "amount_tax":0
      }
    }
  },
  "livemode":false,
  "pending_webhooks":2,
  "request":{
    "id":null,
    "idempotency_key":null
  },
  "type":"checkout.session.completed",
  "stripe":{
    "id":"evt_1HfmqLI4g05dLynGD2sQHt2t",
    "object":"event",
    "api_version":"2020-08-27",
    "created":1603546297,
    "data":{
      "object":{
        "id":"cs_test_IIkDUzSTYjY3svvrw0GWddlC4Nls6cQGhBlbdp3bHzBmw7YFImccq3G8",
        "object":"checkout.session",
        "allow_promotion_codes":null,
        "amount_subtotal":3000,
        "amount_total":3000,
        "billing_address_collection":null,
        "cancel_url":"https://httpbin.org/post",
        "client_reference_id":null,
        "currency":"usd",
        "customer":"cus_IGJTlPYKxCu0ZM",
        "customer_email":null,
        "livemode":false,
        "locale":null,
        "metadata":{

        },
        "mode":"payment",
        "payment_intent":"pi_1HfmqII4g05dLynGZF9YH5za",
        "payment_method_types":[
          "card"
        ],
        "payment_status":"paid",
        "setup_intent":null,
        "shipping":null,
        "shipping_address_collection":null,
        "submit_type":null,
        "subscription":"NEW CHECKOUT SUBSCRIPTION",
        "success_url":"https://httpbin.org/post",
        "total_details":{
          "amount_discount":0,
          "amount_tax":0
        }
      }
    },
    "livemode":false,
    "pending_webhooks":2,
    "request":{
      "id":null,
      "idempotency_key":null
    },
    "type":"checkout.session.completed"
  }
}
