test/fixtures/files/stripe/invoice_paid.json

{
  "id":"evt_1HfmvII4g05dLynG7aLT4IHs",
  "object":"event",
  "api_version":"2020-08-27",
  "created":1603546604,
  "data":{
    "object":{
      "id":"in_1HfmvGI4g05dLynGykFGhZKf",
      "object":"invoice",
      "account_country":"CZ",
      "account_name":"Breaded",
      "account_tax_ids":null,
      "amount_due":2000,
      "amount_paid":2000,
      "amount_remaining":0,
      "application_fee_amount":null,
      "attempt_count":1,
      "attempted":true,
      "auto_advance":false,
      "billing_reason":"manual",
      "charge":"ch_1HfmvHI4g05dLynG2lEZn2gd",
      "collection_method":"charge_automatically",
      "created":1603546602,
      "currency":"usd",
      "custom_fields":null,
      "customer":"cus_IGJYPCL1mwURx0",
      "customer_address":null,
      "customer_email":null,
      "customer_name":null,
      "customer_phone":null,
      "customer_shipping":null,
      "customer_tax_exempt":"none",
      "customer_tax_ids":[

      ],
      "default_payment_method":null,
      "default_source":null,
      "default_tax_rates":[

      ],
      "description":"(created by Stripe CLI)",
      "discount":null,
      "discounts":[

      ],
      "due_date":null,
      "ending_balance":0,
      "footer":null,
      "hosted_invoice_url":"https://pay.stripe.com/invoice/acct_1HeFW8I4g05dLynG/invst_IGJY2E7LLp1PrUt3tldEGfAOgjhN5zG",
      "invoice_pdf":"https://pay.stripe.com/invoice/acct_1HeFW8I4g05dLynG/invst_IGJY2E7LLp1PrUt3tldEGfAOgjhN5zG/pdf",
      "lines":{
        "object":"list",
        "data":[
          {
            "id":"il_1HfmvGI4g05dLynGpUGi7Dxl",
            "object":"line_item",
            "amount":2000,
            "currency":"usd",
            "description":"(created by Stripe CLI)",
            "discount_amounts":[

            ],
            "discountable":true,
            "discounts":[

            ],
            "invoice_item":"ii_1HfmvGI4g05dLynGGdNAcBmi",
            "livemode":false,
            "metadata":{

            },
            "period":{
              "end":1603546602,
              "start":1603546602
            },
            "plan":null,
            "price":{
              "id":"price_1HfmvGI4g05dLynGXllPQOw2",
              "object":"price",
              "active":false,
              "billing_scheme":"per_unit",
              "created":1603546602,
              "currency":"usd",
              "livemode":false,
              "lookup_key":null,
              "metadata":{

              },
              "nickname":null,
              "product":"prod_IGJY9V7mMiPBPe",
              "recurring":null,
              "tiers_mode":null,
              "transform_quantity":null,
              "type":"one_time",
              "unit_amount":2000,
              "unit_amount_decimal":"2000"
            },
            "proration":false,
            "quantity":1,
            "subscription":null,
            "tax_amounts":[

            ],
            "tax_rates":[

            ],
            "type":"invoiceitem"
          }
        ],
        "has_more":false,
        "total_count":1,
        "url":"/v1/invoices/in_1HfmvGI4g05dLynGykFGhZKf/lines"
      },
      "livemode":false,
      "metadata":{

      },
      "next_payment_attempt":null,
      "number":"BBAABEAB-0002",
      "paid":true,
      "payment_intent":"pi_1HfmvHI4g05dLynGitccUwas",
      "period_end":1603546602,
      "period_start":1603546602,
      "post_payment_credit_notes_amount":0,
      "pre_payment_credit_notes_amount":0,
      "receipt_number":null,
      "starting_balance":0,
      "statement_descriptor":null,
      "status":"paid",
      "status_transitions":{
        "finalized_at":1603546603,
        "marked_uncollectible_at":null,
        "paid_at":1603546603,
        "voided_at":null
      },
      "subscription":null,
      "subtotal":2000,
      "tax":null,
      "total":2000,
      "total_discount_amounts":[

      ],
      "total_tax_amounts":[

      ],
      "transfer_data":null,
      "webhooks_delivered_at":null
    }
  },
  "livemode":false,
  "pending_webhooks":2,
  "request":{
    "id":"req_HpI5aqjKIRXthe",
    "idempotency_key":null
  },
  "type":"invoice.paid",
  "stripe":{
    "id":"evt_1HfmvII4g05dLynG7aLT4IHs",
    "object":"event",
    "api_version":"2020-08-27",
    "created":1603546604,
    "data":{
      "object":{
        "id":"in_1HfmvGI4g05dLynGykFGhZKf",
        "object":"invoice",
        "account_country":"CZ",
        "account_name":"Breaded",
        "account_tax_ids":null,
        "amount_due":2000,
        "amount_paid":2000,
        "amount_remaining":0,
        "application_fee_amount":null,
        "attempt_count":1,
        "attempted":true,
        "auto_advance":false,
        "billing_reason":"manual",
        "charge":"ch_1HfmvHI4g05dLynG2lEZn2gd",
        "collection_method":"charge_automatically",
        "created":1603546602,
        "currency":"usd",
        "custom_fields":null,
        "customer":"cus_IGJYPCL1mwURx0",
        "customer_address":null,
        "customer_email":null,
        "customer_name":null,
        "customer_phone":null,
        "customer_shipping":null,
        "customer_tax_exempt":"none",
        "customer_tax_ids":[

        ],
        "default_payment_method":null,
        "default_source":null,
        "default_tax_rates":[

        ],
        "description":"(created by Stripe CLI)",
        "discount":null,
        "discounts":[

        ],
        "due_date":null,
        "ending_balance":0,
        "footer":null,
        "hosted_invoice_url":"https://pay.stripe.com/invoice/acct_1HeFW8I4g05dLynG/invst_IGJY2E7LLp1PrUt3tldEGfAOgjhN5zG",
        "invoice_pdf":"https://pay.stripe.com/invoice/acct_1HeFW8I4g05dLynG/invst_IGJY2E7LLp1PrUt3tldEGfAOgjhN5zG/pdf",
        "lines":{
          "object":"list",
          "data":[
            {
              "id":"il_1HfmvGI4g05dLynGpUGi7Dxl",
              "object":"line_item",
              "amount":2000,
              "currency":"usd",
              "description":"(created by Stripe CLI)",
              "discount_amounts":[

              ],
              "discountable":true,
              "discounts":[

              ],
              "invoice_item":"ii_1HfmvGI4g05dLynGGdNAcBmi",
              "livemode":false,
              "metadata":{

              },
              "period":{
                "end":1603546602,
                "start":1603546602
              },
              "plan":null,
              "price":{
                "id":"price_1HfmvGI4g05dLynGXllPQOw2",
                "object":"price",
                "active":false,
                "billing_scheme":"per_unit",
                "created":1603546602,
                "currency":"usd",
                "livemode":false,
                "lookup_key":null,
                "metadata":{

                },
                "nickname":null,
                "product":"prod_IGJY9V7mMiPBPe",
                "recurring":null,
                "tiers_mode":null,
                "transform_quantity":null,
                "type":"one_time",
                "unit_amount":2000,
                "unit_amount_decimal":"2000"
              },
              "proration":false,
              "quantity":1,
              "subscription":null,
              "tax_amounts":[

              ],
              "tax_rates":[

              ],
              "type":"invoiceitem"
            }
          ],
          "has_more":false,
          "total_count":1,
          "url":"/v1/invoices/in_1HfmvGI4g05dLynGykFGhZKf/lines"
        },
        "livemode":false,
        "metadata":{

        },
        "next_payment_attempt":null,
        "number":"BBAABEAB-0002",
        "paid":true,
        "payment_intent":"pi_1HfmvHI4g05dLynGitccUwas",
        "period_end":1603546602,
        "period_start":1603546602,
        "post_payment_credit_notes_amount":0,
        "pre_payment_credit_notes_amount":0,
        "receipt_number":null,
        "starting_balance":0,
        "statement_descriptor":null,
        "status":"paid",
        "status_transitions":{
          "finalized_at":1603546603,
          "marked_uncollectible_at":null,
          "paid_at":1603546603,
          "voided_at":null
        },
        "subscription":null,
        "subtotal":2000,
        "tax":null,
        "total":2000,
        "total_discount_amounts":[

        ],
        "total_tax_amounts":[

        ],
        "transfer_data":null,
        "webhooks_delivered_at":null
      }
    },
    "livemode":false,
    "pending_webhooks":2,
    "request":{
      "id":"req_HpI5aqjKIRXthe",
      "idempotency_key":null
    },
    "type":"invoice.paid"
  }
}
